bookers2-follow/app/models/book.rb

INSERT INTO "favorites" ("user_id", "book_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 2], ["book_id", 2], ["created_at", "2020-01-12 11:19:30.797264"], ["updated_at", "2020-01-12 11:19:30.797264"]]
---
  def iine(user)
    favorites.create(user_id: user.id)

DELETE FROM "favorites" WHERE "favorites"."id" = ?  [["id", 1]]
---
  def uniine(user)
    favorites.find_by(user_id: user.id).destroy