bookers2-follow/app/models/user.rb

INSERT INTO "relationships" ("follower_id", "following_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["follower_id", 5], ["following_id", 5], ["created_at", "2020-01-14 06:27:40.028539"], ["updated_at", "2020-01-14 06:27:40.028539"]]
---
  def follow!(other_user)
    following_relationships.create!(following_id: other_user.id)

DELETE FROM "relationships" WHERE "relationships"."id" = ?  [["id", 13]]
---
  def unfollow!(other_user)
    following_relationships.find_by(following_id: other_user.id).destroy