bookers2-follow/app/views/favorites/_favorite.html.erb

    <% if book.iine?(current_user) %>
      <%= form_for(book.favorites.find_by(user_id: current_user.id), method: :delete, remote: true) do |f| %>
---
SELECT  "favorites".* FROM "favorites" WHERE "favorites"."book_id" = ? AND "favorites"."user_id" = ? LIMIT ?  [["book_id", 1], ["user_id", 1], ["LIMIT", 1]]