bookers2-follow/app/views/users/_unfollow.html.erb

SELECT "relationships".* FROM "relationships" WHERE "relationships"."following_id" = ?  [["following_id", 5]]
---
<%= form_for(current_user.following_relationships.find_by(following_id: user.id), html: { method: :delete }) do |f| %>