bookers2-follow/app/views/books/show.html.erb

SELECT COUNT(*) FROM "users" INNER JOIN "relationships" ON "users"."id" = "relationships"."follower_id" WHERE "relationships"."following_id" = ?  [["following_id", 2]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
								<strong id="following" class="stat">
									<%= @book.user.followings.count %>

SELECT COUNT(*) FROM "users" INNER JOIN "relationships" ON "users"."id" = "relationships"."following_id" WHERE "relationships"."follower_id" = ?  [["follower_id", 2]]
---
								<strong id="followers" class="stat">
									<%= @book.user.followers.count %>