bookers2-follow/app/controllers/books_controller.rb

	def index
		@user = User.find(current_user.id)
		@book = Book.new
		@books = Book.all
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "books".* FROM "books"

  def create
		@book = Book.new(book_params)
		@book.user_id = current_user.id
  	if @book.save
  		redirect_to book_path(@book), notice: "successfully created book!"
		else
			@books = Book.all
			@user = User.find(current_user.id)
---
INSERT INTO "books" ("title", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "きゃすばる"], ["body", "しなんじゅ"], ["user_id", 1], ["created_at", "2020-01-12 10:34:04.653596"], ["updated_at", "2020-01-12 10:34:04.653596"]]
SELECT "books".* FROM "books"
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]

  def update
  	if @book.update(book_params)
  		redirect_to @book, notice: "successfully updated book!"
		else
  		@books = Book.all
      @user = User.find(current_user.id)
---
UPDATE "books" SET "title" = ?, "body" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["title", "りりー少尉"], ["body", "ばんしーのるん"], ["updated_at", "2020-01-10 09:09:07.688324"], ["id", 5]]
SELECT "books".* FROM "books"
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]