bookers2-follow/app/controllers/book_comments_controller.rb

   def create
    @book = Book.find(params[:book_id])
    @book_comment = @book.book_comments.build(book_comment_params)
    @book_comment.user_id = current_user.id
    if @book_comment.save
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "book_comments" ("content", "book_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["content", "りょうかい"], ["book_id", 2], ["user_id", 1], ["created_at", "2020-01-12 10:43:19.868416"], ["updated_at", "2020-01-12 10:43:19.868416"]]

  def destroy
    @book_comment = BookComment.find(params[:id])
    if @book_comment.destroy
---
SELECT  "book_comments".* FROM "book_comments" WHERE "book_comments"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "book_comments" WHERE "book_comments"."id" = ?  [["id", 1]]