bookers2-follow/app/controllers/favorites_controller.rb

  def create
    @book = Book.find(params[:book_id])
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def destroy
    @book = Favorite.find(params[:id]).book
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT  "favorites".* FROM "favorites" WHERE "favorites"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]