bookers2-follow/app/controllers/users_controller.rb

	def index
		@book = Book.new
		@users = User.all
		@user = User.find(current_user.id)
---
SELECT "users".* FROM "users"
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

	def following
      @user  = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]

  def update
  	if @user.update(user_params)
---
UPDATE "users" SET "name" = ?, "introduction" = ?, "profile_image_id" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "花木"], ["introduction", "マカダミア"], ["profile_image_id", "23c557d02f586d20432bed8f5e65dce9252fad4c693ceeb78b009d96fd2b"], ["updated_at", "2020-01-09 09:57:12.866066"], ["id", 2]]